# diseases.py

DISEASE_INFO = {
    
    "Class_29": {
        "arabic_name": "اللفحة المبكرة (Early Blight)",
        "plant_type": "طماطم / بطاطس",
        "symptoms": "ظهور بقع بنية داكنة على الأوراق القديمة محاطة بدوائر صفراء.",
        "cause": "عدوى فطرية تنتشر في الجو الدافئ والرطب.",
        "treatment": [
            "رش مبيد فطري نحاسي مناسب.",
            "إزالة الأوراق السفلى المصابة والتخلص منها بعيداً عن المزروعات.",
            "تجنب ري الأوراق مباشرة من الأعلى وتقليل الرطوبة."
        ]
    },
    "Bacterial_Spot": {
        "arabic_name": "تبقع بكتيري",
        "plant_type": "خوخ / مانجو / طماطم",
        "symptoms": "اصفرار في أطراف الورقة مع وجود بقع داكنة بنيّة أو سوداء.",
        "cause": "عدوى بكتيرية تنتقل عن طريق الرطوبة العالية ورش المياه.",
        "treatment": [
            "رش مركبات النحاس المعتمدة.",
            "إزالة الأوراق المصابة والتخلص منها بعيداً.",
            "تقليل الرطوبة والري المباشر على الأوراق."
        ]
    },
    "Tomato___Early_blight": {
        "arabic_name": "اللفحة المبكرة في الطماطم",
        "plant_type": "طماطم",
        "symptoms": "بقع بنية على الأوراق القديمة مع حلقات دائرية حول البقع.",
        "cause": "فطر ينمو في الطقس الدافئ والرطب.",
        "treatment": [
            "رش مبيدات فطريات مناسبة.",
            "التخلص من الأوراق السفلى المصابة.",
            "تحسين تهوية النباتات."
        ]
    }
}